zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_etzpc.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_etzpc.h
  * @author  MCD Application Team
  * @brief   Header file for ETZPC utility functions.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_HAL_ETZPC_H
#define STM32MP13xx_HAL_ETZPC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_ll_etzpc.h"

#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @defgroup ETZPC_HAL ETZPC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private Macros ------------------------------------------------------------*/
/** @defgroup ETZPC_HAL_Private_Macros ETZPC Private Macros
  * @{
  */

#define ETZPC_CHECK_PROTECTION(p) assert_param( \
                                          p == LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE || \
                                          p == LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE || \
                                          p == LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE)

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup ETZPC_LL_Exported_Functions ETZPC Exported Functions
  * @{
  */

/** @defgroup ETZPC_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Set Secure SYSRAM size.
  *         Define the size of the secure SYSRAM at low address and non-secure at high
  *
  *         This function can be called from startup, and as such respect following rules:
  *           - it must have less than four arguments
  *           - it must not call another function
  *
  * @param  ETZPCx ETZPC Instance
  * @param  size  Size of secure zone
  *               0x000: all SYSRAM is non-secure
  *               0x001: 4K Byte SYSRAM secure
  *               0x002: 8K Byte SYSRAM secure
  *               ....
  *               0x040 to 0x3FF: 256K Byte SYSRAM secure (e.g all SYSRAM secure) <-- reset value in ETZPC/TZMA1
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_SetSecureSysRamSize(ETZPC_TypeDef *ETZPCx, uint32_t size)
{
  assert_param(size <= 0x3FFU);
  LL_ETZPC_SetSecureSysRamSize(ETZPCx, size);
}

/**
  * @brief  Lock Secure RAM size.
  *
  *         Lock the size of the secure RAM until next reset.
  *
  *         This function can be called from startup, and as such respect following rules:
  *           - it must have less than four arguments
  *           - it must not call another function
  *
  * @param  ETZPCx ETZPC Instance
  *
  * @retval None
  *
 */
__STATIC_INLINE void HAL_ETZPC_LockSecureSysRamSize(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_LockSecureSysRamSize(ETZPCx);
}

/**
  * @brief  Set all peripherals (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_All_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_All_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set VREFBUF peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_VREFBUF_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_VREFBUF_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set LPTIM2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_LPTIM2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_LPTIM2_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set LPTIM3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_LPTIM3_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_LPTIM3_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set LTDC layer 2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_LTDC_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_LTDC_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set DCMIPP peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_DCMIPP_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_DCMIPP_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set USBPHYC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_USBPHYC_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_USBPHYC_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set DDRCTRL and DDRPHYC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_DDRCTRL_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_DDRCTRL_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set Independent Watchdog 1 (IWDG1) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_IWDG1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_IWDG1_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set System Timer Generator (STGENC) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_STGENC_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_STGENC_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set secure USART1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_USART1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_USART1_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set secure USART2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_USART2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_USART2_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SPI4 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SPI4_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SPI4_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SPI5 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SPI5_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SPI5_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set I2C3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_I2C3_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_I2C3_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set I2C4 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_I2C4_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_I2C4_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set I2C5 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_I2C5_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_I2C5_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set TIM12 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_TIM12_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_TIM12_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set TIM13 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_TIM13_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_TIM13_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set TIM14 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_TIM14_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_TIM14_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set TIM15 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_TIM15_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_TIM15_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set TIM16 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_TIM16_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_TIM16_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set TIM17 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_TIM17_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_TIM17_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set ADC1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_ADC1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_ADC1_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set ADC2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_ADC2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_ADC2_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set OTG peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_OTG_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_OTG_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set RNG peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_RNG_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_RNG_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set HASH peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_HASH_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_HASH_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set CRYP peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_CRYP_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_CRYP_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SAES peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SAES_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SAES_PeriphProtection(ETZPCx, protection);
}

