zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_etzpc.h
/**
  * @brief  Set PKA peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_PKA_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_PKA_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set Backup RAM (BKPSRAM) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_BKPSRAM_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_BKPSRAM_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set ETH1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_ETH1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_ETH1_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set ETH2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_ETH2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_ETH2_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SDMMC1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SDMMC1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SDMMC1_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SDMMC2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SDMMC2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SDMMC2_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set DDRMCE peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_DDRMCE_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_DDRMCE_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set FMC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_FMC_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_FMC_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set QSPI peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_QSPI_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_QSPI_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SRAM1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SRAM1_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SRAM1_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SRAM2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SRAM2_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SRAM2_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Set SRAM3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @param  protection  : protection level of the peripheral : possible values are
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_NONSECURE_WRITE_SECURE
  *                      - LL_ETZPC_PERIPH_PROTECTION_READ_WRITE_NONSECURE
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Set_SRAM3_PeriphProtection(ETZPC_TypeDef *ETZPCx, uint32_t protection)
{
  ETZPC_CHECK_PROTECTION(protection);
  LL_ETZPC_Set_SRAM3_PeriphProtection(ETZPCx, protection);
}

/**
  * @brief  Lock all peripherals (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_All_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_All_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock VREFBUF peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_VREFBUF_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_VREFBUF_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock LPTIM2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_LPTIM2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_LPTIM2_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock LPTIM3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_LPTIM3_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_LPTIM3_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock LTDC layer 2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_LTDC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_LTDC_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock DCMIPP peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_DCMIPP_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_DCMIPP_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock USBPHYC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_USBPHYC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_USBPHYC_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock DDRCTRL and DDRPHYC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_DDRCTRL_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_DDRCTRL_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock Independent Watchdog 1 (IWDG1) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_IWDG1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_IWDG1_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock System Timer Generator (STGENC) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_STGENC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_STGENC_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock secure USART1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_USART1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_USART1_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock secure USART2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_USART2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_USART2_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SPI4 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SPI4_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SPI4_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SPI5 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SPI5_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SPI5_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock I2C3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_I2C3_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_I2C3_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock I2C4 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_I2C4_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_I2C4_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock I2C5 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_I2C5_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_I2C5_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock TIM12 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_TIM12_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_TIM12_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock TIM13 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_TIM13_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_TIM13_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock TIM14 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_TIM14_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_TIM14_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock TIM15 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_TIM15_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_TIM15_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock TIM16 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_TIM16_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_TIM16_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock TIM17 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_TIM17_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_TIM17_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock ADC1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_ADC1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_ADC1_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock ADC2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_ADC2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_ADC2_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock OTG peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_OTG_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_OTG_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock RNG peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_RNG_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_RNG_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock HASH peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_HASH_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_HASH_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock CRYP peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_CRYP_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_CRYP_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SAES peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SAES_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SAES_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock PKA peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_PKA_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_PKA_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock Backup RAM (BKPSRAM) peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_BKPSRAM_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_BKPSRAM_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock ETH1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_ETH1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_ETH1_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock ETH2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_ETH2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_ETH2_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SDMMC1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SDMMC1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SDMMC1_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SDMMC2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SDMMC2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SDMMC2_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock DDRMCE peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_DDRMCE_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_DDRMCE_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock FMC peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_FMC_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_FMC_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock QSPI peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_QSPI_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_QSPI_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SRAM1 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SRAM1_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SRAM1_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SRAM2 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SRAM2_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SRAM2_PeriphProtection(ETZPCx);
}

/**
  * @brief  Lock SRAM3 peripheral (ETZPC Securable peripheral) protection.
  *
  * @param  ETZPCx ETZPC Instance
  * @retval None
  */
__STATIC_INLINE void HAL_ETZPC_Lock_SRAM3_PeriphProtection(ETZPC_TypeDef *ETZPCx)
{
  LL_ETZPC_Lock_SRAM3_PeriphProtection(ETZPCx);
}

/**
  * @}
  */

/**
  * @}
  */

/* ---------------------------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP13xx_HAL_ETZPC_H */
